{
  "title": "Projects",
  "paragraph": "Welcome to the projects section of my portfolio. Here you'll find a selection of my most recent work as a junior frontend developer, showcasing my skills in Vue.js, Nuxt.js, TypeScript, and Sass. Each project reflects my commitment to creating fast, scalable web interfaces with an appealing design. I hope it inspires you, and I look forward to collaborating soon!",
  "projectCards": [
    {
      "id": 1,
      "title": "AFR Design & Printing",
      "image": {
        "url": "/img/afrimpresiones.png",
        "alt": "Mockup of an online store for personalized products"
      },
      "description": [
        {
          "id": 1,
          "text": "AFR Impresiones is an e-commerce platform designed to provide an efficient experience for both customers and administrators."
        },
        {
          "id": 2,
          "text": "The app allows users to register and manage their profile with updatable data such as name, email, phone, and address, ensuring a secure and personalized session."
        },
        {
          "id": 3,
          "text": "The order process, although it doesn't include a payment gateway or a form to complete the purchase, allows orders to be stored in the database, which users can consult directly from their profile. This enables an organized and efficient tracking of completed purchases."
        }
      ],
      "technologies": {
        "title": "Technologies used",
        "icons": [
          {
            "id": 1,
            "name": "html",
            "title": "HTML5"
          },
          {
            "id": 2,
            "name": "css",
            "title": "CSS"
          },
          {
            "id": 3,
            "name": "javascript",
            "title": "JavaScript"
          },
          {
            "id": 4,
            "name": "php",
            "title": "PHP"
          },
          {
            "id": 5,
            "name": "mysql",
            "title": "MySQL"
          }
        ]
      },
      "button": {
        "text": "View project",
        "link": "https://afrimpresiones.com/"
      }
    },
    {
      "id": 2,
      "title": "Vibe-Live",
      "image": {
        "url": "/img/vibe-live.png",
        "alt": "Mockup of a Twitch clone"
      },
      "description": [
        {
          "id": 1,
          "text": "Vibe Live is a real-time streaming platform inspired by Twitch, created with Nuxt.js, Vue.js, and TypeScript. It uses the official Twitch API to authenticate users, display channel and stream data."
        },
        {
          "id": 2,
          "text": "Users can enjoy a complete streaming experience with live broadcast viewing and real-time chat."
        },
        {
          "id": 3,
          "text": "The project is deployed on Vercel and is optimized for both desktop and mobile devices."
        }
      ],
      "technologies": {
        "title": "Technologies used",
        "icons": [
          {
            "id": 1,
            "name": "nuxt",
            "title": "Nuxt"
          },
          {
            "id": 2,
            "name": "vue",
            "title": "Vue"
          },
          {
            "id": 3,
            "name": "typescript",
            "title": "TypeScript"
          },
          {
            "id": 4,
            "name": "sass",
            "title": "SCSS"
          }
        ]
      },
      "button": {
        "text": "View project",
        "link": "https://vibe-live.vercel.app/"
      }
    }
  ]
}
